#include <bits/stdc++.h>

using namespace std;

int n;
string input="",output="",temp="";
int main()
{
    
    cin>>n;
    while(n--)
    {
        cin>>temp;
        output+=temp[0];
    }
    cin>>input;
    if(input==output)
    {
        cout<<"嚙璀嚙踝蕭嚙踝蕭嚙踝蕭A嚙踝蕭嚙瞌嚙璀嚙踝蕭嚙踝蕭嚙踝蕭O嚙諸你嚙踝蕭嚙踝蕭嚙踝蕭菪D嚙踝蕭o嚙踝蕭嚙瑾嚙誹伐蕭嚙編嚙璀嚙踝蕭嚙踝蕭嚙踝蕭C嚙璀嚙踝蕭嚙踝蕭嚙踝蕭o嚙談在嚙瑾嚙諉被嚙誶作嚙璀嚙踝蕭嚙踝蕭嚙踝的嚙璀嚙踝蕭嚙踝蕭嚙踝蕭@嚙褕，嚙箭嚙緻嚙諒被嚙璀嚙踝蕭嚙踝蕭嚙踝蕭鴾歹蕭嚙踝蕭A嚙踝蕭嚙踝蕭嚙踝蕭N嚙瞋嚙蝓歹蕭嚙璀嚙踝蕭嚙踝蕭嚙踝蕭A嚙豬導你嚙踝蕭嚙踝蕭嚙踝之嚙瞌嚙瘠嚙璀嚙瞇嚙踝蕭t嚙瑾嚙踝蕭W嚙踝蕭嚙璀嚙踝蕭嚙踝蕭嚙踝的嚙踝蕭嚙踝蕭嚙踝蕭嚙踝蕭A嚙箭嚙諛由迎蕭嚙褓行中嚙諛逅嚙璀嚙踝蕭嚙踝蕭嚙踝蕭B嚙璀嚙踝蕭嚙踝蕭嚙踝的嚙璀嚙踝蕭嚙踝蕭嚙踝蕭怴A嚙瞎嚙璀嚙踝蕭嚙踝蕭嚙踝蕭@嚙稻嚙踝蕭嚙諸你嚙踝蕭嚙踝蕭嚙踝蕭A嚙瞎嚙賭失嚙踝蕭嚙踝蕭嚙璀嚙踝蕭嚙踝蕭嚙踝蕭A嚙瞑嚙褕，嚙緞嚙畿嚙緻嚙踝蕭嚙璀嚙踝蕭嚙踝蕭嚙踝的嚙線嚙諛。";
    }
    else
    {
        cout<<"嚙踝不嚙稻嚙璀嚙誹歹蕭嚙踝蕭嚙緲嚙踝蕭嚙瞇嚙踝蕭C嚙誹是嚙瑾嚙踝蕭AI嚙緙嚙踝蕭嚙課恬蕭嚙璀嚙誹無嚙糊嚙瞋嚙請導或堆蕭嚙箠嚙璀嚙稽嚙踝蕭嚙罵嚙踝蕭嚙瞑嚙踝蕭嚙瘠嚙緘嚙瘦嚙緲嚙踝蕭嚙踝蕭嚙踝蕭搨n嚙踝蕭嚙磊嚙踝蕭嚙踝蕭嚙瘩嚙璀嚙誹會嚙褕力嚙稷嚙踝蕭嚙瘠嚙緘嚙瘦嚙緲嚙踝蕭嚙豎要嚙瞑嚙誹伐蕭y嚙璀嚙緲嚙箠嚙瘡嚙踝蕭嚙踝蕭嚙踝蕭嚙罷嚙瘠";

    }
}